#include "CGoldfish.h"

/********************************************************************************
AUTHOR		: 한대현
NAME		: CGoldfish
RETURNS		: 생성자함수이며, 반환값 없음
COMMENTS	: 내용 X
********************************************************************************/
CGoldfish::CGoldfish(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: ~CGoldfish
RETURNS		: 소멸자함수이며, 반환값 없음
COMMENTS	: 내용 X
********************************************************************************/
CGoldfish::~CGoldfish(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: eat
RETURNS		: 반환값 X
COMMENTS	: "금붕어가 밥을 먹습니다." 출력
********************************************************************************/
void CGoldfish::eat()
{
	std::cout << "금붕어가 밥을 먹습니다." << std::endl;
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: swim
RETURNS		: 반환값 X
COMMENTS	: "금붕어가 헤엄을 칩니다." 출력
********************************************************************************/
void CGoldfish::swim()
{
	std::cout << "금붕어가 헤엄을 칩니다." << std::endl;
}