#include "CRectangle.h"

/********************************************************************************
AUTHOR		: 한대현
NAME		: CRectangle
RETURNS		: 반환값 X
COMMENTS	: 생성자 함수
********************************************************************************/
CRectangle::CRectangle(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: ~CRectangle
RETURNS		: 반환값 X
COMMENTS	: 소멸자 함수
********************************************************************************/
CRectangle::~CRectangle(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: draw
RETURNS		: 반환값 X
COMMENTS	: 사각형 출력 내용 안내 함수
********************************************************************************/
void CRectangle::draw()
{
	cout << "Rectangle Draw" << endl;
}