#include "CTriangle.h"

/********************************************************************************
AUTHOR		: 한대현
NAME		: CTriangle
RETURNS		: 반환값 X
COMMENTS	: 생성자 함수
********************************************************************************/
CTriangle::CTriangle(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: ~CTriangle
RETURNS		: 반환값 X
COMMENTS	: 소멸자 함수
********************************************************************************/
CTriangle::~CTriangle(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: draw
RETURNS		: 반환값 X
COMMENTS	: 삼각형 출력 내용 안내 함수
********************************************************************************/
void CTriangle::draw()
{
	cout << "Triangle Draw" << endl;
}