#include "CDeskLamp.h"

/********************************************************************************
	AUTHOR		: 한대현
	NAME		: CDeskLamp
	RETURNS		: 생성자함수이며, 반환값 없음
	COMMENTS	: 생성자함수로 쓰이며, 최초 객체 생성시 멤버변수(m_bIsOn)에
				  false값을 대입함
	********************************************************************************/
	CDeskLamp::CDeskLamp()
	{
		m_bIsOn = OFF;
	}

	/********************************************************************************
	AUTHOR		: 한대현
	NAME		: ~CDeskLamp
	PARAMS		: [IN ] 
				  [OUT] 
	RETURNS		: 소멸자함수이며, 반환값 없음
	COMMENTS	: 따로 수행되는 내용은 없음
	********************************************************************************/
	CDeskLamp::~CDeskLamp()
	{
	}

	/********************************************************************************
	AUTHOR		: 한대현
	NAME		: turnOn
	RETURNS		: 반환값 X
	COMMENTS	: 멤버변수(m_bIsOn)의 내용을 true로 변경
	********************************************************************************/
	void CDeskLamp::turnOn()
	{
		m_bIsOn = ON;
		print();
	}

	/********************************************************************************
	AUTHOR		: 한대현
	NAME		: turnOff
	RETURNS		: 반환값 X
	COMMENTS	: 멤버변수(m_bIsOn)의 내용을 false로 변경
	********************************************************************************/
	void CDeskLamp::turnOff()
	{
		m_bIsOn = OFF;
		print();
	}

	/********************************************************************************
	AUTHOR		: 한대현
	NAME		: print
	RETURNS		: 반환값 X
	COMMENTS	: 멤버변수(m_bIsOn)의 내용에 따라 다른 내용을 출력하는 함수
	********************************************************************************/
	void CDeskLamp::print()
	{
		if(ON == m_bIsOn)
		{
			cout << "램프가 켜짐" << endl;
		}
		else if(OFF == m_bIsOn)
		{
			cout << "램프가 꺼짐" << endl;
		}
	}