#include "CCircle.h"
/********************************************************************************
AUTHOR		: 한대현
NAME		: CCircle
RETURNS		: 생성자함수이며, 반환값 없음
COMMENTS	: 생성자함수로 쓰임
********************************************************************************/
CCircle::CCircle() : m_center(), m_nRadius(0)
{
	cout << "중심 : ";
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: CCircle
PARAMS		: [IN ] nR
			  [OUT] 생성자함수이며, 반환값 없음
COMMENTS	: 멤버 이니셜라이져 문법을 사용하여 radius를 초기화함
********************************************************************************/
CCircle::CCircle(const int nR) : m_nRadius(nR)
{

}

/********************************************************************************
AUTHOR		: 한대현
NAME		: CCircle
PARAMS		: [IN ] p, nR
			  [OUT] 생성자함수이며, 반환값 없음
COMMENTS	: 멤버 이니셜라이져 문법을 사용하여 p와 radius를 초기화함
********************************************************************************/
CCircle::CCircle(const CPoint p, const int nR) : m_center(p), m_nRadius(nR)
{

}

/********************************************************************************
AUTHOR		: 한대현
NAME		: CCircle
PARAMS		: [IN ] nX, nY, nR
			  [OUT] 생성자함수이며, 반환값 없음
COMMENTS	: 멤버 이니셜라이져 문법을 사용하여 nX와 nY를 이용해 m_center를
			  초기화 시킨 후 추가로 nR값 또한 초기화 시킴
********************************************************************************/
CCircle::CCircle(const int nX, const int nY, const int nR) : m_center(nX, nY), m_nRadius(nR)
{
	cout << "중심 : ";
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: print
COMMENTS	: 멤버 이니셜라이져 문법을 사용하여 p와 radius를 초기화함
********************************************************************************/
void CCircle::print()
{
	cout << "중심 : ";
	m_center.print();
	cout << "반지름 : " << m_nRadius << endl << endl;
}