#include "CPoint.h"
/********************************************************************************
AUTHOR		: 한대현
NAME		: CPoint
RETURNS		: 생성자함수이며, 반환값 없음
COMMENTS	: 생성자함수로 쓰임
********************************************************************************/
CPoint::CPoint() : m_nX(0), m_nY(0)
{

}

/********************************************************************************
AUTHOR		: 한대현
NAME		: CTime
PARAMS		: [IN ] nA, nB
			  [OUT] 생성자함수이며, 반환값 없음
COMMENTS	: 멤버 이니셜라이져 문법을 사용하여 nX와 nY를 초기화함
********************************************************************************/
CPoint::CPoint(const int nA, const int nB) : m_nX(nA), m_nY(nB)
{

}

/********************************************************************************
AUTHOR		: 한대현
NAME		: print
RETURNS		: 반환값 없음
COMMENTS	: 멤버 변수(nX, nY)의 값을 출력하는 함수
********************************************************************************/
void CPoint::print()
{
	cout << "(" << m_nX << ", " << m_nY << ")\n";
}