#include "CGoldfish.h"

/********************************************************************************
AUTHOR		: 한대현
NAME		: CGoldfish
RETURNS		: 반환값 X
COMMENTS	: 디폴트 생성자
********************************************************************************/
CGoldfish::CGoldfish(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: ~CGoldfish
RETURNS		: 반환값 X
COMMENTS	: 디폴트 소멸자
********************************************************************************/
CGoldfish::~CGoldfish(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: swim
RETURNS		: 반환값 X
COMMENTS	: "살랑살랑" 출력
********************************************************************************/
void CGoldfish::swim()
{
	cout << "살랑살랑" << endl;
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: eats
RETURNS		: 반환값 X
COMMENTS	: "금붕어가 밥을 먹습니다." 출력
********************************************************************************/
void CGoldfish::eats()
{
	cout << "금붕어가 밥을 먹습니다." << endl;
}