#include "CLandAnimals.h"

/********************************************************************************
AUTHOR		: 한대현
NAME		: CLandAnimals
RETURNS		: 반환값 X
COMMENTS	: 디폴트 생성자
********************************************************************************/
CLandAnimals::CLandAnimals(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: ~CLandAnimals
RETURNS		: 반환값 X
COMMENTS	: 디폴트 소멸자
********************************************************************************/
CLandAnimals::~CLandAnimals(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: crawl
RETURNS		: 반환값 X
COMMENTS	: "엉금엉금" 출력
********************************************************************************/
void CLandAnimals::crawl()
{
	cout << "엉금엉금" << endl;
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: eats
RETURNS		: 반환값 X
COMMENTS	: "우걱우걱" 출력
********************************************************************************/
void CLandAnimals::eats()
{
	cout << "우걱우걱" << endl;
}