#include "CShape.h"

/********************************************************************************
AUTHOR		: 한대현
NAME		: CShape
RETURNS		: 반환값 X
COMMENTS	: 내용 X
********************************************************************************/
CShape::CShape(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: ~CShape
RETURNS		: 반환값 X
COMMENTS	: 내용 X
********************************************************************************/
CShape::~CShape(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: setArea
RETURNS		: 반환값 X
COMMENTS	: 도형 별 넓이 계산 공식 출력
********************************************************************************/
void CShape::setArea(double dW, double dH)
{
	cout << "삼각형 공식 : 밑변 X 높이 / 2" << endl;
	cout << "사각형 공식 : 밑변 X 높이" << endl;
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: getArea
RETURNS		: double 자료형
COMMENTS	: 계산된 넓이를 반환한다.
********************************************************************************/
double CShape::getArea()
{
	return dArea;
}