#include "CTriangle.h"

/********************************************************************************
AUTHOR		: 한대현
NAME		: CRectangle
RETURNS		: 반환값 X
COMMENTS	: 내용 X
********************************************************************************/
CTriangle::CTriangle(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: ~CRectangle
RETURNS		: 반환값 X
COMMENTS	: 내용 X
********************************************************************************/
CTriangle::~CTriangle(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: setArea
RETURNS		: 반환값 X
COMMENTS	: 사각형의 넓이를 계산하고 멤버변수(dArea)에 대입한다.
********************************************************************************/
void CTriangle::setArea(double dW, double dH)
{
	dArea = dW * dH;
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: getArea
RETURNS		: double 자료형
COMMENTS	: 계산된 넓이를 반환한다.
********************************************************************************/
double CTriangle::getArea()
{
	return dArea;
}