#include "CUnderwaterAnimals.h"

/********************************************************************************
AUTHOR		: 한대현
NAME		: CUnderwaterAnimals
RETURNS		: 반환값 X
COMMENTS	: 디폴트 생성자
********************************************************************************/
CUnderwaterAnimals::CUnderwaterAnimals(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: ~CUnderwaterAnimals
RETURNS		: 반환값 X
COMMENTS	: 디폴트 소멸자
********************************************************************************/
CUnderwaterAnimals::~CUnderwaterAnimals(void)
{
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: swim
RETURNS		: 반환값 X
COMMENTS	: "어푸어푸" 출력
********************************************************************************/
void CUnderwaterAnimals::swim()
{
	cout << "어푸어푸" << endl;
}

/********************************************************************************
AUTHOR		: 한대현
NAME		: eats
RETURNS		: 반환값 X
COMMENTS	: "쩝쩝" 출력
********************************************************************************/
void CUnderwaterAnimals::eats()
{
	cout << "쩝쩝" << endl;
}